# Data Cleaning : Time Series Data


- A hypothetical company, ABC Financial Services Corp makes financial investment decisions on behalf of it's clients based on the company's economic research. A lot of these decisions involve speculating whether financial instruments will increase or decrease in value in the future.
- ABC Corp utilizes several economic indicators but there is one in particular that is heavily weighted in their analysis and that is the [University of Michigan's Consumer Sentiment Survey](https://en.wikipedia.org/wiki/University_of_Michigan_Consumer_Sentiment_Index).
- The only problem is that they have to wait for the release of this indicator which erodes some of their competitive advantage in the market and they would like a way to predict this number.
- I propose to use a form of Machine Learning (ML) to make Time Series preditions on the final Consumer Sentiment number to be released.
- To do this we are going to use other economic indicators (as features) released before and data from various relevant industries to construct a dataset that is ready to run on predictive algorithims.
- The historical datasets that ABC Corp uses will be downloaded as follows:
    - [The Dow Jones Index](https://finance.yahoo.com/quote/%5EDJI/history/)
    - [US Unemployemnt (Jobless Claims) data from the US Department of Labor](https://fred.stlouisfed.org/series/UNRATE)
    - [Historical price of Crude Oil in the open market](https://fred.stlouisfed.org/series/MCOILBRENTEU)
    - [New Housing Starts from US Census Beareau](https://fred.stlouisfed.org/series/HOUST#0)
    - [Total Vehicles Sold](https://fred.stlouisfed.org/series/TOTALSA)
    - [Retail Sales data from US Census Beareau](https://fred.stlouisfed.org/series/RSXFS)
    - [Federal Interest Rates](https://fred.stlouisfed.org/series/FEDFUNDS])
    - [The University of Michigan's Consumer Sentiment Survey](http://www.sca.isr.umich.edu/)  -- data to predict

Data cleaning is highly dependent on the type of data and the task to be achieved. In our case we combine data from different sources and clean up the resulting dataframe. In image classification data, we may have to reshape the image sizes and create labels while a sentiment analysis dataset may need to be checked for spelling and keyword extraction.

Moving forward, we will first import any libraries that we need to handle our data cleaning process.

In [2]:
# Import necessary libraries

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
from scipy import stats
from datetime import datetime
from functools import reduce
import datetime
sns.set_style("darkgrid")

## Exercise 1:

1- Load all datasets (locate at `../data/` repository) to pandas DataFrames
```python
>>> dow     = 
>>> unemp   =
>>> oil     = 
>>> hstarts = 
>>> cars    = 
>>> retail  = 
>>> fedrate = 
>>> umcsi   = 
```

In [7]:
# Your code here
dow     = pd.read_csv('../data/Dow Jones Industrial Average DJI.csv')
unemp   = pd.read_csv('../data/Civilian Unemployment Rate UNRATE.csv')
oil     = pd.read_csv('../data/Crude Oil Prices MCOILBRENTEU.csv')
hstarts = pd.read_csv('../data/Housing Starts HOUST.csv')
cars    = pd.read_csv('../data/Total Vehicle SalesTOTALSA .csv')
retail  = pd.read_csv('../data/Advance Retail Sales_RSXFS.csv')
fedrate = pd.read_csv('../data/Federal Interest Rates FEDFUNDS.csv')
umcsi   = pd.read_excel('../data/consumer_sent_UMCH_tbmics.xls')

2- Visually inspect the dataframes
    - 5 first rows for dow, umemp an oil
    - 5 last rows for umcsi and cars

In [18]:
# Your code here
dow.head(5)

,Date,Open,High,Low,Close,Adj Close,Volume
0,1985-01-01,1277.719971,1305.099976,1266.890015,1286.770020,1286.770020,44450000
1,1985-02-01,1276.939941,1307.530029,1263.910034,1284.010010,1284.010010,207300000
2,1985-03-01,1285.339966,1309.959961,1242.819946,1266.780029,1266.780029,201050000
3,1985-04-01,1264.800049,1290.300049,1245.800049,1258.060059,1258.060059,187110000
4,1985-05-01,1257.180054,1320.790039,1235.530029,1315.410034,1315.410034,242250000

In [19]:
unemp.head(5)

         DATE  UNRATE
0  1948-01-01     3.4
1  1948-02-01     3.8
2  1948-03-01     4.0
3  1948-04-01     3.9
4  1948-05-01     3.5

In [21]:
oil.head(5)

         DATE  MCOILBRENTEU
0  1987-05-01         18.58
1  1987-06-01         18.86
2  1987-07-01         19.86
3  1987-08-01         18.98
4  1987-09-01         18.31

In [22]:
umcsi.tail(5)

    Unnamed: 0  Unnamed: 1 THE INDEX OF CONSUMER SENTIMENT
572  September      2017.0                            95.1
573    October      2017.0                           100.7
574   November      2017.0                            98.5
575   December      2017.0                            95.9
576    January      2018.0                            95.7

In [24]:
cars.tail(5)

           DATE  TOTALSA
500  2017-09-01     18.9
501  2017-10-01     18.4
502  2017-11-01     17.9
503  2017-12-01     18.2
504  2018-01-01     17.5

3- Get the shape of the different datasets

In [25]:
# Your code here
dow.shape,unemp.shape,oil.shape,hstarts.shape,cars.shape,retail.shape,fedrate.shape,umcsi.shape

((399, 7),
 (841, 2),
 (369, 2),
 (709, 2),
 (505, 2),
 (313, 2),
 (763, 2),
 (577, 3))

4- Get dataframe top rows view

In [26]:
# Your code here
hstarts.head()

         DATE   HOUST
0  1959-01-01  1657.0
1  1959-02-01  1667.0
2  1959-03-01  1620.0
3  1959-04-01  1590.0
4  1959-05-01  1498.0

In [27]:
retail.head()

         DATE   RSXFS
0  1992-01-01  146913
1  1992-02-01  147270
2  1992-03-01  146831
3  1992-04-01  148082
4  1992-05-01  149015

In [28]:
fedrate.head()

         DATE  FEDFUNDS
0  1954-07-01      0.80
1  1954-08-01      1.22
2  1954-09-01      1.06
3  1954-10-01      0.85
4  1954-11-01      0.83

5- Print the statistical charateristics of the datsets. 
    - Explain the output
    > write your answer here

In [31]:
# Your code here
dow.describe()

,Open,High,Low,Close,Adj Close,Volume
count,399.000000,399.000000,399.000000,399.000000,399.000000,3.990000e+02
mean,8942.156345,9234.280992,8663.219038,9000.773103,9000.773103,2.708308e+09
std,5477.903361,5608.611050,5352.618142,5521.219058,5521.219058,2.235050e+09
min,1257.180054,1290.300049,1235.530029,1258.060059,1258.060059,4.445000e+07
25%,3437.250000,3523.595093,3389.560059,3475.595092,3475.595092,5.350650e+08
50%,9492.320313,9986.490234,9116.519531,9712.280273,9712.280273,2.173260e+09
75%,12112.234863,12372.229981,11643.939942,12180.399902,12180.399902,4.639150e+09
max,26083.039063,26616.710938,25149.259766,26149.390625,26149.390625,1.056106e+10

6- Which datasets have null values

In [37]:
# Your code here
print(dow.isnull().sum())
print(unemp.isnull().sum())
print(oil.isnull().sum())
print(hstarts.isnull().sum())
print(cars.isnull().sum())
print(retail.isnull().sum())
print(fedrate.isnull().sum())

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64
DATE      0
UNRATE    0
dtype: int64
DATE            0
MCOILBRENTEU    0
dtype: int64
DATE     0
HOUST    0
dtype: int64
DATE       0
TOTALSA    0
dtype: int64
DATE     0
RSXFS    0
dtype: int64
DATE        0
FEDFUNDS    0
dtype: int64

In [38]:
print(umcsi.isnull().sum())

Unnamed: 0                         3
Unnamed: 1                         4
THE INDEX OF CONSUMER SENTIMENT    3
dtype: int64

The only dataset that has null values umcsi

7- What are your observations ?
> write your answer here

## Exercise 2: dow dataset

1- Drop column volume

In [41]:
# Your code here
dow1 = dow.drop(['Volume'], axis = 1)
dow1.head()

         Date         Open         High          Low        Close    Adj Close
0  1985-01-01  1277.719971  1305.099976  1266.890015  1286.770020  1286.770020
1  1985-02-01  1276.939941  1307.530029  1263.910034  1284.010010  1284.010010
2  1985-03-01  1285.339966  1309.959961  1242.819946  1266.780029  1266.780029
3  1985-04-01  1264.800049  1290.300049  1245.800049  1258.060059  1258.060059
4  1985-05-01  1257.180054  1320.790039  1235.530029  1315.410034  1315.410034

2- Rename columns to upper case to match other dfs

In [45]:
# Your code here
dow1.rename(columns = {'Date':'DATE','Open':'OPEN','High':'HIGH','Low':'LOW','Close':'CLOSE','Adj Close':'ADJ CLOSE'}, inplace = True)
dow1.head()

         DATE         OPEN         HIGH          LOW        CLOSE    ADJ CLOSE
0  1985-01-01  1277.719971  1305.099976  1266.890015  1286.770020  1286.770020
1  1985-02-01  1276.939941  1307.530029  1263.910034  1284.010010  1284.010010
2  1985-03-01  1285.339966  1309.959961  1242.819946  1266.780029  1266.780029
3  1985-04-01  1264.800049  1290.300049  1245.800049  1258.060059  1258.060059
4  1985-05-01  1257.180054  1320.790039  1235.530029  1315.410034  1315.410034

3- Create 'Year' column with int values instead of float. Use function bellow:

```python
>>> def to_int(x):
>>>     return int(x)
```

In [ ]:
# Your code here
def to_int(x):
    return int(x)
year = [to_int(x) ]
dow['Year'] = year

## Exercise 3: umcsi dataset

1- Drop NaN Values

In [49]:
# Your code here
umcsi = umcsi.dropna(axis = 0)
print(umcsi.isnull().sum())

Unnamed: 0                         0
Unnamed: 1                         0
THE INDEX OF CONSUMER SENTIMENT    0
dtype: int64

2- Combine year columns to one column format

In [ ]:
# Your code here

3- Turn date format to string to match other DATE's for umcsi dataset. We'll merge the data on this column so this is a vital step. Use the function bellow:

```python
>>> def to_str(x):
>>>     return str(x)[:10]
```

In [ ]:
# Your code here
def to_str(x):
    return str(x)[:10]
umcsi['Date']

4- Drop unneeded columns for umcsi dataset

In [ ]:
# Your code here

5- Move 'DATE' column to the front

In [ ]:
# Your code here

## Exercice 3:

1- Concatenate all dataframes into one final dataframe using `lambda` function
    - Use the function `reduce` imported from `functools` library

In [ ]:
# Your code here
df.apply(lambda x: func(x['col1'],x['col2']),axis=1)

2- Remove all rows with outliers in at least one row

In [ ]:
# Your code here

3- Change the DATE column from String to python's datetime.datetime format

In [ ]:
# Your code here

4- Rename columns to more user friendly names. Use the code bellow:

```python
>>> df.columns = ['DATE', 'OPEN', 'HIGH', 'LOW', 'CLOSE', 'ADJ CLOSE', 'VOLUME', 'UNEMP %','OIL PRICE','NEW HOMES','NEW CARS SOLD', 'RETAIL SALES','FED INTRST %','CSI' ]
```

In [ ]:
# Your code here

5- Visualize a few basic end data characteristics.
<img src="../data/DowJonesIndustrials.png" alt="Drawing" style="width: 500px;"/>
<img src="../data/FederalInterestRate.png" alt="Drawing" style="width: 500px;"/>
<img src="../data/BrentCrudeOilperbarrel.png" alt="Drawing" style="width: 500px;"/>
<img src="../data/NewHomeStarts.png" alt="Drawing" style="width: 500px;"/>

6- Plot the correclation matrix. What's you observations ?

In [ ]:
# Your code here

7- Drop the less useful columns

In [3]:
# Your code here

8- Create a new column / feature from subtracting the LOW and HIGH column called SPREAD which is the difference between the two.

In [3]:
# Your code here

9- Move the SPREAD column next to CLOSE as they are related

In [3]:
# Your code here

10- Reset the index

In [3]:
# Your code here

11- View final dataframe correlation matrix

In [3]:
# Your code here

12- Compare your final result with data on file `../data/cleaned_timeseries.csv`

In [3]:
# Your code here

13- What's your conclusion ?
> Write you answer here